{"class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 5, 63, 138], "dtype": "float32", "sparse": false, "name": "input_3"}, "inbound_nodes": []}, {"name": "input_4", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 20, 13], "dtype": "float32", "sparse": false, "name": "input_4"}, "inbound_nodes": []}, {"name": "model_1", "class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 5, 63, 138], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "conv1_visual", "class_name": "Conv2D", "config": {"name": "conv1_visual", "trainable": true, "filters": 32, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "bn1_visual", "class_name": "BatchNormalization", "config": {"name": "bn1_visual", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1_visual", 0, 0, {}]]]}, {"name": "relu1_visual", "class_name": "Activation", "config": {"name": "relu1_visual", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn1_visual", 0, 0, {}]]]}, {"name": "pool1_shriking_visual", "class_name": "MaxPooling2D", "config": {"name": "pool1_shriking_visual", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["relu1_visual", 0, 0, {}]]]}, {"name": "conv2_visual", "class_name": "Conv2D", "config": {"name": "conv2_visual", "trainable": true, "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["pool1_shriking_visual", 0, 0, {}]]]}, {"name": "bn2_visual", "class_name": "BatchNormalization", "config": {"name": "bn2_visual", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_visual", 0, 0, {}]]]}, {"name": "relu2_visual", "class_name": "Activation", "config": {"name": "relu2_visual", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2_visual", 0, 0, {}]]]}, {"name": "pool2_visual", "class_name": "MaxPooling2D", "config": {"name": "pool2_visual", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["relu2_visual", 0, 0, {}]]]}, {"name": "conv5_visual", "class_name": "Conv2D", "config": {"name": "conv5_visual", "trainable": true, "filters": 128, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["pool2_visual", 0, 0, {}]]]}, {"name": "bn5_visual", "class_name": "BatchNormalization", "config": {"name": "bn5_visual", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv5_visual", 0, 0, {}]]]}, {"name": "relu5_visual", "class_name": "Activation", "config": {"name": "relu5_visual", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn5_visual", 0, 0, {}]]]}, {"name": "pool5_visual", "class_name": "MaxPooling2D", "config": {"name": "pool5_visual", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["relu5_visual", 0, 0, {}]]]}, {"name": "flatten_visual", "class_name": "Flatten", "config": {"name": "flatten_visual", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["pool5_visual", 0, 0, {}]]]}, {"name": "fc6_visual", "class_name": "Dense", "config": {"name": "fc6_visual", "trainable": true, "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_visual", 0, 0, {}]]]}, {"name": "bn6_visual", "class_name": "BatchNormalization", "config": {"name": "bn6_visual", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["fc6_visual", 0, 0, {}]]]}, {"name": "relu6_visual", "class_name": "Activation", "config": {"name": "relu6_visual", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn6_visual", 0, 0, {}]]]}, {"name": "fc7_visual", "class_name": "Dense", "config": {"name": "fc7_visual", "trainable": true, "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu6_visual", 0, 0, {}]]]}, {"name": "bn7_visual", "class_name": "BatchNormalization", "config": {"name": "bn7_visual", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["fc7_visual", 0, 0, {}]]]}, {"name": "relu7_visual", "class_name": "Activation", "config": {"name": "relu7_visual", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn7_visual", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["relu7_visual", 0, 0]]}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "model_2", "class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 20, 13], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "conv1_audio", "class_name": "Conv2D", "config": {"name": "conv1_audio", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "bn1_audio", "class_name": "BatchNormalization", "config": {"name": "bn1_audio", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1_audio", 0, 0, {}]]]}, {"name": "relu1_audio", "class_name": "Activation", "config": {"name": "relu1_audio", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn1_audio", 0, 0, {}]]]}, {"name": "conv2_audio", "class_name": "Conv2D", "config": {"name": "conv2_audio", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu1_audio", 0, 0, {}]]]}, {"name": "bn2_audio", "class_name": "BatchNormalization", "config": {"name": "bn2_audio", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_audio", 0, 0, {}]]]}, {"name": "relu2_audio", "class_name": "Activation", "config": {"name": "relu2_audio", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2_audio", 0, 0, {}]]]}, {"name": "pool2_shriking_audio", "class_name": "MaxPooling2D", "config": {"name": "pool2_shriking_audio", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["relu2_audio", 0, 0, {}]]]}, {"name": "conv5_audio", "class_name": "Conv2D", "config": {"name": "conv5_audio", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["pool2_shriking_audio", 0, 0, {}]]]}, {"name": "bn5_audio", "class_name": "BatchNormalization", "config": {"name": "bn5_audio", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv5_audio", 0, 0, {}]]]}, {"name": "relu5_audio", "class_name": "Activation", "config": {"name": "relu5_audio", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn5_audio", 0, 0, {}]]]}, {"name": "pool5_audio", "class_name": "MaxPooling2D", "config": {"name": "pool5_audio", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["relu5_audio", 0, 0, {}]]]}, {"name": "flatten_audio", "class_name": "Flatten", "config": {"name": "flatten_audio", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["pool5_audio", 0, 0, {}]]]}, {"name": "fc6_audio", "class_name": "Dense", "config": {"name": "fc6_audio", "trainable": true, "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_audio", 0, 0, {}]]]}, {"name": "bn6_audio", "class_name": "BatchNormalization", "config": {"name": "bn6_audio", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["fc6_audio", 0, 0, {}]]]}, {"name": "relu6_audio", "class_name": "Activation", "config": {"name": "relu6_audio", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn6_audio", 0, 0, {}]]]}, {"name": "fc7_audio", "class_name": "Dense", "config": {"name": "fc7_audio", "trainable": true, "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu6_audio", 0, 0, {}]]]}, {"name": "bn7_audio", "class_name": "BatchNormalization", "config": {"name": "bn7_audio", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["fc7_audio", 0, 0, {}]]]}, {"name": "relu7_audio", "class_name": "Activation", "config": {"name": "relu7_audio", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn7_audio", 0, 0, {}]]]}], "input_layers": [["input_2", 0, 0]], "output_layers": [["relu7_audio", 0, 0]]}, "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "function": ["4wEAAAAAAAAAAwAAAAcAAABDAAAAczQAAAB8AFwCfQF9AnQAagF0AGoCdABqA3QAagR8AXwCGACD\nAWQBZAJkA40DdABqBYMAgwKDAVMAKQRO6QEAAABUKQLaBGF4aXPaCGtlZXBkaW1zKQbaAUvaBHNx\ncnTaB21heGltdW3aA3N1bdoGc3F1YXJl2gdlcHNpbG9uKQNaBXZlY3Rz2gF42gF5qQByDAAAAPpe\nL2Fmcy9pbmYuZWQuYWMudWsvdXNlci9hL2Flc2hreS9QeWNoYXJtUHJvamVjdHMvdWx0cmF4MjAy\nMC9zeW5jaHJvbmlzYXRpb24vdHdvX3N0cmVhbV9tb2RlbC5wedoSZXVjbGlkZWFuX2Rpc3RhbmNl\nIAIAAHMEAAAAAAEIAQ==\n", null, null], "function_type": "lambda", "output_shape": ["4wEAAAAAAAAAAwAAAAIAAABDAAAAcxQAAAB8AFwCfQF9AnwBZAEZAGQCZgJTACkDTukAAAAA6QEA\nAACpACkD2gZzaGFwZXPaBnNoYXBlMdoGc2hhcGUycgMAAAByAwAAAPpeL2Fmcy9pbmYuZWQuYWMu\ndWsvdXNlci9hL2Flc2hreS9QeWNoYXJtUHJvamVjdHMvdWx0cmF4MjAyMC9zeW5jaHJvbmlzYXRp\nb24vdHdvX3N0cmVhbV9tb2RlbC5wedoQZ2V0X291dHB1dF9zaGFwZSUCAABzBAAAAAABCAE=\n", null, null], "output_shape_type": "lambda", "arguments": {}}, "inbound_nodes": [[["model_1", 1, 0, {}], ["model_2", 1, 0, {}]]]}], "input_layers": [["input_3", 0, 0], ["input_4", 0, 0]], "output_layers": [["lambda_1", 0, 0]]}, "keras_version": "2.2.2", "backend": "tensorflow"}